
<template>
  <div>
    <van-button type="primary" @click="sendMail">主要按钮</van-button>
  </div>
</template>

<script>
import axios from "axios";
export default {
  data() {
    return {
      mailParam: {
        sendTo: "3189840163@qq.com",
        subject: "121",
        text: "fsafs",
      },
      times: 0,
    };
  },
  created() {},
  methods: {
    sendMail() {
      for (let i = 0; i < 1; i++) {

        // 随机等待时长
        // await new Promise((resolve) => {
        //   setTimeout(() => {
        //     resolve();
        //   }, this.getNum(2000, 12000));
        // });

        this.mailParam.subject = "第 " + (i + 1) + " 封信";
        // this.mailParam.text = this.getContent(i % 199);

        this.mailParam.text = `<div style="text-align: center;font-size: 17px;height: 30px;">
            ${this.getContent(i % 199)}
            </div>
            <div style="text-align: center;">
             <img src="https://img14.360buyimg.com/pop/jfs/t1/526/16/17706/169340/628d845bE4e59bd9b/a107e0d634075e3f.jpg" width="60%" style="border-radius:12px ;">
            </div>`;
        axios.post("/sendMail/html", this.mailParam);

      }
    },
    getNum(star, end) {
      return Math.floor(Math.random() * (end - star)) + star;
    },
    getContent(index) {
      let a = [
        "每想你一次，天上飘落一粒沙，从此形成了撒哈拉。",
        "我这一生都是坚定不移的唯物主义者，可自从遇到你，我希望有来生。",
        "长久以来， 我一直需要一个能导我于正确航向的舵手。但到目前为止，除了你没有第二人。",

        "一见你的眼睛，我便清醒起来，我更喜欢看你那晕红的双腮，黄昏时的霞彩似的，谢谢你给我力量。",
        "从前山是山，水是水，树是树，自我知你在此山中，山是蓬莱山，水是星河水，树是连理树。",
        "第一次见你的时候，我的心里已经炸成了烟花，需要用一生来打扫灰炉。",

        "我把四季用来等你。时光静",
        "静下来想你，觉得一切都美好得不可思议。",
        "听到一些事，明明不相关，但总能在心里拐几个弯想到你。",

        "还没分别，已在心里写信。",

        "我知道你会来，所以我等",
        "从今以后,咱们只有死别,不再生离。",
        "月色与雪色之间，你是第三种绝色",
        "春水初生,春林初盛,春风十里,不如你。",
        "别问我心里有没有你，我余光中都是你",
        "望你珍摄吻你万千，情长纸短还吻你万千",
        "时光如水,总是无言。若你安好,便是晴天。",
        "没有人能与你相比,从我爱你的那一刻开始。",
        "还想再掬一捧春光泼入心房,暖遍我一汪岁月。",
        "每想你一次,天上飘落一粒沙,从此形成了撒哈拉。",
        "眼睛为她下着雨,心却为她打着伞,这就是爱情。",
        "你的过去我来不及参与,你的未来我奉陪到底。",
        "从前日色过得慢,车马邮件都慢,一生只够爱一个人。",
        "我一辈子都是坚定的唯物主义者,唯有你,我希望有来生。",
        "你来人间一趟,你要看看太阳。和你的心的,一起走在街上。",
        "你要是愿意,我就永远爱你,你要是不愿意,我就永远相思",
        "答案很长我准备用一生的时间来回答，你准备好要听了吗",
        "遇到你之前,我没想过结婚。遇见你之后,结婚这事我没想过和别人。",
        "我把我整个的灵魂都给你,连同它的怪癖,耍小脾气,忽明忽暗,一千八百种坏毛病,它真讨厌,只有一点好,爱你。",
        "我行过许多地方的桥,看过许多次的云,喝过许多种类的酒,却只爱讨一个正当最好年纪的人。",
        "遇见你之前,我没有想过结婚,遇见你之后,结婚我没想过别人。",
        "不要愁老之将至,你老了也一定很可爱,而且,假如你老了十岁,我当也同样老了十岁,世界也老了十岁,上帝也老了十岁,一切都是一样的。",
        "我寄你的信,总要送往邮局,不喜欢放在街边的绿色邮筒中,我总疑心那里会慢一些",
        "在青山绿水之间我想牵着你的手走过这座桥。桥上是绿叶红花,桥下是流水人家,桥的那头是青丝,桥的那头是白发",
        "唯有你的光辉,能像漫过山岭的薄雾像和风从静谧的世界琴弦里带来的夜曲,像朗照溪水的月色。",
        "那就折一张阔些的荷叶包一片月光回去,回去夹在唐诗生书单，扁扁的象压过的相思。",
        "他跑了三十里的马,让海风吹硬了脸只为来这里,看你一眼空空的窗,空与不空,全是他自己的事。",
        "如果你呼唤我,我就为你跨生越死,为你而重履入世,我会褰裳涉水,离开冥河。",
        "第一次见你的时候,我的心里已经炸成了烟花,需要用一生来打扫灰炉。",
        "我总不能阻止他奔向比我更好的人吧，可我就是觉得除了我谁都配不上他",

        "时光静好，与君语；细水流年，与君同；繁华落尽，与君老。",
        "生如夏花之绚烂，死如秋叶之静美。",
        "人生若只如初见，何事秋风悲画扇。等闲变却故人心，却道故人心易变。骊山语罢清宵半，泪雨霖铃终不怨。何如薄幸锦衣郎，比翼连枝当日愿。",
        "听闻先生治家有方，小女余生愿闻其详。",
        "近朱者赤，近你者甜。",
        "夜月一帘幽梦，春风十里柔情。",
        "人生时间其实很短暂，不要太累，这一生会有我在默默的关心和祝福你。",
        "谁说现在是冬天呢？当你在我身旁时，我感到百花齐放，鸟唱蝉鸣。",
        "两个人一起是为了快乐，分手是为了减轻痛苦，你无法再令我快乐，我也唯有离开，我离开的时候，也很痛苦，只是，你肯定比我痛苦，因为我首先说再见，首先追求快乐的是我。",
        "人生最精彩的不是实现梦想的瞬间，而是坚持梦想的过程。",
        "思念不能自已，痛苦不能自理，结果不能自取，幸福不能自予。",
        "不是每一次努力都会有收获，但是，每一次收获都必须努力，这是一个不公平的不可逆转的命题。",
        "忘掉岁月，忘掉痛苦，忘掉你的坏，我们永不永不说再见。",
        "每个生日都有礼物，都有祝福，无论你有多少个愿望，多少个梦想，我的礼物是我的心，陪着你成长！生日快乐！",
        "许多良辰美景，要和你一个一个去耽误。",
        "你在南方的艳阳里大雪纷飞，我在北方的寒夜里四季如春。",
        "七月，满天星开花了。花铺满了整片原野，一片雪白。如此怒放的季节，你我，我可敬可爱的朋友们，相约在这一片花海中。",
        "凡事都有偶然的凑巧，结果却又如宿命的必然。",
        "离去，让事情变得简单，人们变得善良，像个孩子一样，我们重新开始。",
        "我上辈子不知行了多少善，才能在最美的年华里遇见你。",
        "我们像是表面上的针，不停的转动，一面转，一面看着时间匆匆离去，却无能为力。",
        "把持不住思念的心跳，让我深切体验牵挂的美妙，送你一件用心织成的温暖外套，用祝福将你笼罩，愿快乐永远在你怀抱，幸福放声欢笑。",
        "愿你早日学会逢场作戏，愿你早点习惯物是人非，毕竟不是每一个人都和天真的你一样容易动真情。",
        "每晚睡前听你说晚安，是属于我的，最简单而持久的幸福。",
        "你来人间一趟，你要看看太阳，和你的心上人，一起走在街上。",
        "我想你的时候最缠绵，无论我们相距多远，前面的路有多坎坷，只想说：你是我今生最大的幸福。祝你生日快乐。",
        "深知身在情长在，怅望江头江水声。",
        "愿你的情话有主，愿你的深情有归宿。晚安，祝你做个好梦。",
        "唱一首写不完的歌，荡漾着爱你的音符。",
        "在青山绿水之间，我想牵着你的手，走过这座桥，桥上是绿叶红花，桥下是流水人家，桥的那头是青丝，桥的这头是白发。",
        "从现在开始，你要好好保重身体，虽然现在你还不是我的，但你的未来是我的。别忘了我们的约定：和我一起变老！",
        "我会带着不倦的温柔体贴，在你身边走动，尽管你不会对我报之以微笑；我会永不厌腻的盯着你的眼睛，尽管那双眼睛已不再射出一缕确认我的光芒。",
        "你的理科，我教，你的作业，我写，你的爱情，我来。",
        "繁星落城，漫若浮光。",
        "我把祝福，写满在天上那晚新月，月光流泻，照耀在你的身边，霎时间，健康伴随着你，好运笼罩着你，快乐包围着你，幸福一辈子都跟着你。愿你开心每天。",
        "幸得识卿桃花雨，从此阡陌皆暖春。",
        "要有多坚强，敢念念不忘。",
        "晨露蒙月色，清风随佳人。",
        "快乐是缓慢的时光，闭着眼感受你轻柔的呼吸，努力的把甜蜜牢记；幸福是缓慢的时光，静下心给你默默的怜惜，勇敢的把一生牵系！老公，生日快乐！",
        "我的心为你而跳，我的脚陪你走天涯海角，我的手拉着你幸福的走，我的眼看着你美丽永不回头，爱上了你，我很开心，愿意陪着你这样慢慢到老！",
        "当你经历过一些事情的时候，眼前的风景已经跟从前的不一样了。",
        "并非心无所恋，只是怯不敢念，一声“晚安”都要绕好大一圈，任凭世界暗夜谁的容颜，那月雾星辰从不疲倦。",
        "思君令人老，岁月忽已晚。",
        "此情无计可消除，才下眉头，又上心头。",
        "繁华已尽，空散云烟。",
        "我希望有个如你一般的人。如这山间清晨一般明亮清爽的人，如奔赴古城道路上阳光一般的人，温暖而不炙热，覆盖我所有肌肤。由起点到夜晚，由山野到书房，一切问题的答案都很简单。我希望有个如你一般的人，贯彻未来，数遍生命的公路牌。",
        "晚安，晚是世界的晚，安是给你的安。",
        "住进布达拉宫，我是雪域最大的王。流浪在拉萨街头，我是世间最美的情郎。",
        "我与你不需要任何的琐碎来证明在乎的分量，只有不言而喻的默契。",
        "对生命而言，接纳才是最好的温柔，不论是接纳一个人的出现，还是，接纳一个人的从此不见。",
        "屠呦呦和诺贝尔，人类和引力波，小李和奥斯卡，我和你",
        "相爱的时候需要真诚，争执的时候需要沟通，生气的时候需要冷静，愉快的时候需要分享，指责的时候需要谅解，过日子的时候需要包容。",
        "轻吟一句情话，执笔一幅情画。绽放一地情花，覆盖一片情花。",
        "早晨的霞光灿烂无比，早晨的露珠晶莹无比，早晨的鲜花美丽无比，早晨的空气新鲜无比，早晨的心情舒畅无比，祝你早安！",
        "这世间最烈的酒，是你低头噙笑的温柔。",
        "人来人往，繁华似锦。",
        "千万个思念，在空气中凝固。扬起风吹向你，带着我的祝福，寂寞我不在乎，你快乐我就满足，想你是我的幸福！",
        "望月楼，奏古琴，可身边早没了他。挽月湖，吹骨笛，独目远方眺佳人。",
        "保护自己，爱护他人，请不要半夜出来吓人。",
        "我愿成为参天的大树，用坚强有力的臂膀，为你撑起一片快乐的天堂；我愿化为飘零的落叶，用温柔缠绵的语言，为你守候一生幸福的家园，爱你永远。",
        "咫尺天涯，阴阳两隔。",
        "静水流深，沧笙踏歌。",
        "平凡的相识，不平凡的相恋。平凡的相守，不平凡的相见。以后的以后，再平凡不过的生活，只要真心相爱，也能谱写一段美丽的爱情故事，让我们共同努力，亲爱滴！",
        "如果你爱上了某个星球的一朵花。那么，只要在夜晚仰望星空，就会觉得漫天的繁星就像一朵朵盛开的花。",
        "别把秘密告诉风，它会吹遍整个森林",
        "其实天很蓝，阴云总要散；其实海不宽，此岸连彼岸；其实泪也甜，当你心如愿。其实我要你快乐每一天！",
        "与你相遇，如入梦中，从此不愿醒矣。",
        "因为有你世界变得更开朗，因为有你社会变得更祥和，因为有你使我变得更快乐。",
        "流星让夜空感动，生死让人生感动，爱情让生活感动，你让我感动，在感恩节真心祝福你比所有的人都开心快乐。",
        "山河永寂，怎堪欢颜。",
        "只为那一时的温柔，我沉醉其中；只因那一刻的冷漠，我泪如雨下。让我怎么舍得忘记你？让我怎么舍得你心烦？让我怎么舍得你难过？愿我们天天和睦，幸福永久！",
        "易水人去，明月如霜。",
        "面朝大海春暖花开。",
        "愿与君同为比翼双飞之雁，生时共览山海之灿烂。处处留意，倦飞乃知还。死后共化携手之枯骨。葬于南山，命终情不散。",
        "你不是爱情的终点，只是爱情的原动力。我将这爱情献给路旁的花朵，献给玻璃酒杯里摇晃的晶亮阳光，献给教堂的红色圆顶。因为你，我爱上了这个世界。",
        "亲爱的此生有你的陪伴就象灿烂的阳光撒满大地，让我倍感温暖幸福。",
        "太阳还不热烈。眼睛还没睡醒。你是我启程就不想结束的梦境。凉风徐徐到来。繁花争艳盛开。你是我瞳孔酝暖离不开的晴空。",
        "我有缺点，但是我会用优点来待你；我钱不多，但是我会努力地去挣钱来养你；爱情的幸福不在别人的眼里，关键在于我和你。亲，我真的好想你！",
        "把时间折成花海，有一朵是为你绽开，把快乐散落人海，有一种是为你回来，把祝福送进心海，有一句是祝你生日愉快，亲爱的，生日开开心心哦。",
        "思念无果，转瞬滂沱。",
        "你的前半生没有我，那么就让我陪你走完后半生。",
        "赐我三千弱水不为轮回只为途中化作红梅执子之手与子相依偎，情书写尽千回墨已成碑只怕鸟儿已成双对我却写不尽你的美！",
        "三生石上三生声叹九曲江畔久难还",
        "怎样无尽的长夜，都不要忘记你身边的我是不灭的火苗，点燃你心中每一个希望，一生一世为你起舞跳跃，燃烧整个的生命只要你需要光亮。",
        "我愿陪你独守于静谧荒芜的桃源深处听飞鸟啼鸣看冬去春来。",
        "“如果你是一场梦，那么我愿意拥抱整个的夜。”",
        "“为什么阳光是暖的，月光却是凉的？”“因为月亮是孤独的，你可以抬头望月，却要遮挡刺眼的阳光，它就这么静静地挂在那里，在这个时候，夜晚人的心总会空落落的。”“这么晚了，没有感觉到空落落的，只不过我有些冷了。”“那么就住进我的心里来。”",
        "其实全世界最幸福的童话，不过是，与你一起度过柴米油盐的岁月。",
        "每次想你在心头，彩虹也微笑开了口，每次想你在深夜，星星也为我守候。我们的爱遥遥，美了自然界，甜了心尖尖！",
        "《夏至》当白昼躲进地平线，谁是那孤独的夜；当江边点起灯火辉煌，谁是那动人的风；当星空璀璨闪耀光芒，谁做那暗淡的星；当欢声笑语走进寂静空城，谁是那街灯下沉默的影；",
        "我多么希望，有一个门口，早晨，阳光照在草上。我们站着，扶着自己的门窗，门很低，但太阳是明亮的。草在结它的种子，风在摇它的叶子，我们站着，不说话，就十分美好。",
        "如果背叛是一种勇气，那么接受背叛则需要一种更大的勇气。前者只需要有足够的勇敢就可以，又或许只是一时冲动，而后者考验的却是宽容的程度，绝非冲动那么简单，需要的唯有时间。",
        "随着天各一方的时间越来越长，我的思念也越来越深，我很想找一个万籁俱寂的深夜或一个阳光明媚的早晨，把许多心底的惆怅、寂寞向你倾诉。",
        "我愿一直在你身边，化作暖阳，给你温暖。我愿一直在你身边，化作明月，给你光亮。",
        "我喜欢古巨基，也喜欢张根硕。",
        "幸福的秘诀是得到自由，而自由的秘诀是勇气。",
        "世界上那么多的花，我只采你的蜜。",
        "我希望在我们以后的生活中都因为拥有彼此而快乐无边。",
        "我想对你说一声对不起，可是你现在却已是远在他方，我们之间的友谊不会随着时间而改变，但是这一句道歉的话语我还是想当面对你说，请你原谅我当年的无知，祝你在他乡行好运。",
        "雪落无痕，雁过留声。",
        "世界上那么多的花，我只采你的蜜。",
        "在这深情的季节里，我好想送你一束盛开的玫瑰和数不尽的祝福！但愿这玫瑰的清香能淡淡地散发出对你的柔柔关怀和思念的气息。",
        "我喜欢古巨基，也喜欢张根硕。",
        "人的幸福可以有许多种，人会有许多的愿望，人也会有许多的经历，但是对我来讲，最重要的，还是一种幸福，一个心愿，一种经历，那就是一辈子都可以陪着你！",
        "绿水无忧，因风皱面。",
        "我希望，每一个时刻，都象彩色蜡笔那样美丽。我希望，能在心爱的白纸上画画，画出笨拙的自由，画下一只永远不会，流泪的眼睛。一片天空，一片属于天空的羽毛和树叶，一个淡绿的夜晚和苹果。我想画下早晨，画下露水，所能看见的微笑。画下所有最年轻的，没有痛苦的爱情。",
        "最怕深情枉付一生不羁放不下又太执着。",
        "其实我们失去的，不是别的，正是勇气。我们不是没勇气给对方机会，而是没勇气给自己机会。爱不敢用力爱，恨不敢用力恨，错过了又觉得可惜，接受了又怕受伤，畏首畏尾。",
        "雨在下，风太大，夹着沙，眼眶红，泪落下。",
        "在人群之中寻觅着你，就彷佛在海边掬起所有的沙粒，急於发现你的踪迹，如果不从愿，但愿还有来生。",
        "你是航船我是帆，等你归航进港湾，洗去征尘绽笑脸，揽你入怀睡梦甜，祝你天天随心愿，快乐幸福到永远！让思绪的希翼载着幸福，驶向爱和温暖的港湾！",
        "所有人都在说晚安，只有你说陪我到天亮。",
        "若许一世，为何负情。",
        "好想踩着月光，走进你的月夜里，让你轻轻的呼吸声接我走进你的梦。多少个夜晚，望着星空就会想起你。",
        "你以为，我因为贫穷，低微，矮小，不美我就没有灵魂没有心吗？你想错了我的灵魂跟你一样充实，我的内心跟你一样地丰富。我们站在上帝的脚跟前，我们是平等的！",
        "如果我是玫瑰我将给你芬芳，如果我是太阳我将给你阳光；如果我是钻石我将给你永恒；如果我是你的爱我将给你我的全部。",
        "我赠以时间的长诗为聘，在你心上悄悄路过；你回以岁月的容颜为礼，在我眉间温柔拂过。",
        "眼神只是一种方式，但它表达的当时，是它背负的价值。",
        "留不住的人更像风，起码风过无痕。",
        "夜深了，思念在不为人知的暗涌着，疼痛也惊天动地的撕裂着！",
        "想念一个人的寂静，那些悲伤，泛滥成海，我，无处可逃。",
        "从一个湿漉漉的记忆里，拧出一个灰蒙蒙的雨季，窗外飘着的雨，那是我思念的泪滴。",
        "在这个值得庆贺的日子里，我虽无鲜花与美酒献礼，但心中有歌，祝我们的纪念日快乐。",
        "水落红莲，唯闻玉磬。",
        "心若向阳，无畏悲伤。",
        "生命那么短，世界那么乱，我不想争吵，不想冷战，不愿和你有一秒遗憾。",
        "浪漫就是，在寒风呼啸雪花飘舞的日子，轻轻拥你在怀里，坐在火炉旁，即使一句话都不说，却象说了很多。任暖暖的火光在彼此眼里跳跃出最红艳的姿势。",
        "吟风于春，薄酒夜夏。",
        "将情话熬过风霜，在一个阳光灿烂的日子交给你品尝。",
        "破涕为笑是人类版的彩虹。",
        "如能与夏酿花雕，醉浓浓，会须再饮千百杯。冬藏黄酒为青梅，情意浓，终有竹马归来时。",
        "愿她平安喜乐，身边有着干净纯粹的少年郎。",
        "望顶繁花，如水似流。",
        "悲伤的秋千总有微风陪伴，孤寂的夜，总有繁星点点，蓦然回首，而你却不在我身边。",
        "爱的路上情多少，恐怕只有天知晓；想你也要来趁早，一条短信心情表；爱你日子真美好，希望从此直到老；你是我的真财宝，我愿一生对你好。",
        "在我眼里，你的名字是世界上最动人的诗行，让我在无数个瞬间幸福地怀念；在我心中，你的名字是人世间最美的风景，让我一次次地流连忘返。我很爱很爱你，希望你也很爱我！",
        "有了地球，月球从未走出它的轨道；有了天空，星星总在它的怀抱闪耀；有了你，我无法说出思念的美妙。用流星，来划出爱的信号。想着你，我的心好跳！",
        "因你的出现，一切都变得如此的美好。",
        "记忆的窗口里亮着两盏灯，那是你深情的眼睛；你会说话的眼睛对我说：思念的夜即将过去，请迎接相聚的黎明。",
        "月光这么美，我睡不着；抖落心事，擦干心情；把梦，一件件晾在风竽上；远方的你让我好牵挂。",
        "在这淡淡的明月下，在这淡淡的星光里，我的梦又铺向故乡，铺向故乡的你了。",
        "世界上最永恒的幸福就是平凡，人生中最长久的拥有就是珍惜。",
        "如果前世你是那一棵伟岸的树，我必是那常青的藤，如果前世你是那一睹坚挺的墙，我必是那碧绿的草，如果前世你是那世俗的劫，我必是那宿命的孽。亲爱，我爱你，永远。",
        "我渴盼，渴盼着你，绣我一角庭园，绿我一片情思。",
        "思念不变成锚缆牵住船儿，且化做推进器的带，航程多远，思念就多长。",
        "终牵绊，憔思花容颜。",
        "两国相战，不斩来使。",
        "天空没有翅膀的痕迹，但鸟儿已经飞过；心里没有被刀子割过，但疼痛却那么清晰。这些胸口里最柔软的地方，被爱人伤害过的伤口，远比那些肢体所受的伤害来得犀利，而且只有时间，才能够治愈。",
        "愿以后有人陪你烧烤火锅焖大虾，也有人陪你素琴调弦品香茶。",
        "你我一起种的那株葡萄，如今一串串地熟了，瞪着水灵灵的眼睛，盼你来尝一尝甜蜜。",
        "老公：愿我们的爱情永远像幽淡的清茶，香浓的咖啡，浪漫的红酒，热烈的伏特加那样多姿多彩，让人回味。",
        "老公：希望你能一辈子宠我，祝你一辈子找不到除我之外的与我同性的人，除非我已离开人世或重病在身。你的老婆。",
        "叠一只弯弯的纸船，装满我的思念，乘着如水的月光，漂到你的床前，愿这弯弯的纸船停在你的枕畔，让我的思念与祝福护着你的入眠！",
        "在这恬静的春夜，此刻，你进入梦乡了吗？那么，让这相思的红豆化作一颗灿烂的流星，进入你的梦，跟你悄悄地对话。",
        "情话是语序越杂乱越动人，仿佛阅读到一颗慌乱的心情。哦，但其实也不过是荷尔蒙作祟。",
        "幸福就是今夜抬头望向圆月时，家在脚下，爱在身旁。是眼前人，也是心上人，在一起的每一天都是团圆日。",
        "清晨的第一缕阳光是那么美好且绚烂，就如同你一般，早安！",
        "星星的寂寞月知道，晚霞的羞涩云知道，花儿的芬芳蝶知道，青草的温柔风知道，梦里的缠绵心知道，心里的酸楚泪知道，我的思念你知道！我的祝福请记牢：祝中秋节快乐！",
        "秋至暑去起凉风，露似珍珠月似弓。寒湿衣裳雾湿松，无尽思念祝福中。白云悠悠好运送，桂花飘飘香夜空。又是一年白露逢，祝君平安多保重。",
      ];
      // 0-198
      return a[index];
    },
  },
};
</script>

<style scoped>
</style>



